#!/bin/bash
#главное меню + помощь


#попадаем в главное меню

#пункты меню
options=(
	"Управление пользователями" 
	"Управление группами" 
	"Поиск пользователей или групп" 
	
)
COLUMNS=1 #чтобы опции в меню были в обну колонку
#переход в пункт меню в зависимости от выбора
PS3="Введите опцию(q- выход из программы, help - справка меню) "
all_done=0
while (( !all_done )); do  #цикл обеспечивает повторный вывод меню
	echo "---------------
Главное меню"
	select opt in "${options[@]}"
	do
		case $REPLY in
			"1")
				#"Управление пользователями"
				./user_control.sh
				break
				;;
			"2")
				#"Управление группами"
				./group_control.sh
				break
				;;
			"3")
				#"Поиск пользователей или групп"
				./user_group_search.sh
				break
				;;
			"q")
				echo "Выход из программы"
				all_done=1
				break
				;;
			"help")
				echo "--------
Справка: 
1)Управление пользователями - позволяет осуществлять добавление, удаление, блокировку, добавление в группу, смену пароля пользователя
2)Управление группами - осуществляет добавление,удаление, изменение состава группы
3)Поиск пользователей или групп - ищет пользователей или группы"
				break
				;;
			*) echo "Вы неправильно выбрали опцию. Пожалуйста, попробуйте еще раз" >&2
				break
				;;
		esac
	done
done
			
		
