#!/bin/bash

#показываем справочную информацию
show_help(){
#здесь вместо script будет настоящее название сценария
echo "Использование: ./script.sh [КЛЮЧ]
Позволяет управлять пользователями(добавление, удаление, блокировка, добавление в группу, смена пароля)
и группами(добавление,удаление, изменение состава), а также осуществлять поиск пользователей или групп.
Выполнение любого из перечисленных выше действий происходит путем выбора соответствующего пункта в меню и ввода дополнительных аргументов.
SELinux options:
--help         показать эту справку и выйти

Коды возврата:
0 - все отлично" #нужно согласовать, какие нужны коды возврата, пока так
}


################# входная точка сценария
if [ "$1" == "--help" ] ; then 
	show_help
else 
	echo "С помощью данной программы Вы сможете управлять пользователями и группами"
fi;
echo "Разработчики: Сорокин Михаил, Бабкин Сергей, Иванова Екатерина, Курнев Алексей, Степанова Анна"



