#!/bin/bash
#Управление пользователями


#Добавление пользователя
add_user(){
al_done=0
while(( !al_done )); do
	echo "-------------
Добавление пользователя

Введите имя пользователя: "
	read username
	useradd $username 2> /dev/null

	if [ $? == "0" ]
	then
		echo "Новый пользователь успешно добавлен!"
	elif [ $? == "1" ]
	then

		echo "Данный пользователь уже существует!" >&2 
	elif [ $? == "3" ]
	then
		echo "Неверное имя пользователя!" >&2
	else
		echo "Произошел сбой при добавлении пользователя" >&2
	fi
	echo "Повторить?(y/n) "
	read answer
	if [[ $answer == "n" ]]
	then
		break
	fi
done

}




#попадаем в подменю

#пункты подменю
options=(
	"Добавление пользователя"
	"Удалить пользователя" 
	"Блокировка пользователя(запрет на вход в систему)" 
	"Добавление пользователя в группу" 
	"Смена пароля пользователя"
	
)
PS3="Введите опцию(q- возврат назад, help - справка) "
all_done=0
#переход в пункт меню в зависимости от выбора
while (( !all_done )); do  #цикл обеспечивает повторный вывод меню
	echo "-----------------
Меню управления пользователями"
	select opt in "${options[@]}"
	do
		case "$REPLY" in
			1)
				add_user
				break
				;;
			2)
				./delete_user.sh
				break
				;;
			3)
				./block_user.sh
				break				
				;;
			4)
				echo "Добавление пользователя в группу"
				./AddUserToGroup.sh
				break
				;;
			5)
				echo "Смена пароля пользователя"
				./ChangePassword.sh
				break
				;;
			"help")
				echo "-----------
Справка:
1)Добавление пользователя - добавление пользователя по имени
2)Удалить пользователя - удаление существующего пользователя с возможностью удаления его домашнего каталога
3)Блокировка пользователя(запрет на вход в систему) - блокировка пользователя по имени или порядковому номеру, а также его разблокировка
4)Добавление пользователя в группу - добавление в группу пользователя по порядковому номеру или имени
5)Смена пароля пользователя - смена пароля существующего пользователя "
				break
				;;
			"q")
				echo "Возврат назад"
				all_done=1
				break
				;;
			*) echo "Вы неправильно выбрали опцию. Пожалуйста, попробуйте еще раз" >&2
				break
				;;
		esac
	done
done
			
		
