#!/bin/bash
#Управление пользователями

#попадаем в подменю

#пункты подменю
options=(
	"Добавление пользователя"
	"Удалить пользователя" 
	"Блокировка пользователя(запрет на вход в систему)" 
	"Добавление пользователя в группу" 
	"Смена пароля пользователя"
	
)
PS3="Введите опцию(q- возврат назад, help - справка) "
all_done=0
#переход в пункт меню в зависимости от выбора
while (( !all_done )); do  #цикл обеспечивает повторный вывод меню
	echo "-----------------
Меню управления пользователями"
	select opt in "${options[@]}"
	do
		case "$REPLY" in
			1)
				echo "Добавление пользователя"
				break
				;;
			2)
				echo "Удалить пользователя" 
				break
				;;
			3)
				echo "Блокировка пользователя(запрет на вход в систему)"
				break				
				;;
			4)
				echo "Добавление пользователя в группу"
				break
				;;
			5)
				echo "Смена пароля пользователя"
				break
				;;
			"help")
				echo "-----------
Справка:
1)Добавление пользователя - добавление пользователя по имени
2)Удалить пользователя - удаление существующего пользователя с возможностью удаления его домашнего каталога
3)Блокировка пользователя(запрет на вход в систему) - блокировка пользователя по имени или порядковому номеру, а также его разблокировка
4)Добавление пользователя в группу - добавление в группу пользователя по порядковому номеру или имени
5)Смена пароля пользователя - смена пароля существующего пользователя "
				break
				;;
			"q")
				echo "Возврат назад"
				all_done=1
				break
				;;
			*) echo "Вы неправильно выбрали опцию. Пожалуйста, попробуйте еще раз" >&2
				break
				;;
		esac
	done
done
			
		
